import numpy
import matplotlib.pyplot as plt
#初始化numpy.array数组
z=numpy.array([[0, 3.0], [10, 3.0], [20, 3.0], [30, 3.0], [40, 3.0], [50, 3.0], [60, 3.0], [70, 3.0], [80, 3.0], [90, 3.0], [100, 3.0], [110, 3.0], [120, 3.0], [130, 3.0], [140, 3.0], [150, 3.0], [160, 3.0], [170, 3.0], [180, 3.0], [190, 3.0], [200, 3.0], [210, 3.0], [220, 3.0], [230, 3.0], [240, 3.0], [250, 3.0], [260, 3.0], [270, 3.0], [280, 3.0], [290, 3.0], [300, 3.0], [310, 3.0], [320, 3.0], [330, 3.0], [340, 3.0], [350, 3.0], [360, 3.0], [370, 3.0], [380, 3.0], [390, 3.0], [400, 3.0], [410, 3.0], [420, 3.0], [430, 3.0], [440, 3.0], [450, 3.0], [460, 3.0], [470, 3.0], [480, 3.0], [490, 3.0], [500, 3.0], [510, 3.0], [520, 3.0], [530, 3.0], [540, 3.0], [550, 3.0], [560, 3.0], [570, 3.0], [580, 3.0], [590, 3.0], [600, 3.0], [610, 3.0], [620, 3.0], [630, 3.0], [640, 3.0], [650, 3.0], [660, 3.0], [670, 3.0], [680, 3.0], [690, 3.0], [700, 3.0], [710, 3.0], [720, 3.0], [730, 3.0], [740, 3.0], [750, 3.0], [760, 3.0], [770, 3.0], [780, 3.0], [790, 3.0], [800, 3.0], [810, 3.0], [820, 3.0], [830, 3.0], [840, 3.0], [850, 3.0], [860, 3.0], [870, 3.0], [880, 3.0], [890, 3.0], [900, 3.0], [910, 3.0], [920, 3.0], [930, 3.0], [940, 3.0], [950, 3.0], [960, 3.0], [970, 3.0], [980, 3.0], [990, 3.0]]
)
x = numpy.array([[0, 0], [-1, 0.1], [0.3, -0.05], [0.7, 0.3], [-0.2, -0.6], [-0.15, -0.63], [-0.25, 0.55], [-0.28, 0.67]])
y = numpy.array([0, 0, 0, 0, 1, 1, 2, 2])
#Python3使用scatter画散点图，定义一个小函数
def plot_data(features, labels):
    x0,x1,x2 = features[labels==0], features[labels==1], features[labels==2]
    plt.scatter(z[:,0], z[:,1], c='red', s=0.1)
    #plt.xticks(numpy.array())
    plt.axis([-1.5,2000, -1.5,100])#设置横纵坐标

    print(x[:,0])


plt.figure(1)#画第一张图
plt.subplot(221)#一块画布分为2行2列共4份，此时占用第一份
plt.title("scatter points",fontsize=24)#设置title x y
plt.xlabel("Features",fontsize=14)
plt.ylabel("Labels",fontsize=14)
plot_data(x,y)#调用函数
plt.show()#show
'''

plt.figure(2)
plt.title("scatter points",fontsize=24)
plt.xlabel("Features",fontsize=14)
plt.ylabel("Labels",fontsize=14)
x0, x1, x2 = x[y == 0], x[y == 1], x[y == 2]
plt.scatter(x0[:, 0], x0[:, 1], marker='*', c='red', label=0, s=40)#marker定义形状，label与plt.legend画出右上角图例
plt.scatter(x1[:, 0], x1[:, 1], marker='+', c='green', label=1, s=40)# * + o  x  s是方块 d是菱形 
plt.scatter(x2[:, 0], x2[:, 1], marker='o', c='blue', label=2, s=40)
plt.axis([-1.5, 1.5, -1.5, 1.5])
plt.legend(loc='upper right')#center left lower right right upper center lower center center right lower left best.....
plt.show()
'''